apache/nuttx/arch/arm/src/tiva/hardware/cc13x0/cc13x0_prcm.h
/* PRCM Register Bitfield Definitions **************************************************************/

/* Infrastructure Clock Division Factor For Run Mode */

#define PRCM_INFRCLKDIVR_RATIO_SHIFT     (0)       /* Bits 0-1:  Divider for MCU_AON clocks run mode */
#define PRCM_INFRCLKDIVR_RATIO_MASK      (3 << PRCM_INFRCLKDIVR_RATIO_SHIFT)
#  define PRCM_INFRCLKDIVR_RATIO_DIV1    (0 << PRCM_INFRCLKDIVR_RATIO_SHIFT) /*  Divide by 1 */
#  define PRCM_INFRCLKDIVR_RATIO_DIV2    (1 << PRCM_INFRCLKDIVR_RATIO_SHIFT) /*  Divide by 2 */
#  define PRCM_INFRCLKDIVR_RATIO_DIV8    (2 << PRCM_INFRCLKDIVR_RATIO_SHIFT) /*  Divide by 8 */
#  define PRCM_INFRCLKDIVR_RATIO_DIV32   (3 << PRCM_INFRCLKDIVR_RATIO_SHIFT) /*  Divide by 32 */

/* Infrastructure Clock Division Factor For Sleep Mode */

#define PRCM_INFRCLKDIVS_RATIO_SHIFT     (0)       /* Bits 0-1:  Divider for MCU_AON clocks sleep mode */
#define PRCM_INFRCLKDIVS_RATIO_MASK      (3 << PRCM_INFRCLKDIVS_RATIO_SHIFT)
#  define PRCM_INFRCLKDIVS_RATIO_DIV1    (0 << PRCM_INFRCLKDIVS_RATIO_SHIFT) /*  Divide by 1 */
#  define PRCM_INFRCLKDIVS_RATIO_DIV2    (1 << PRCM_INFRCLKDIVS_RATIO_SHIFT) /*  Divide by 2 */
#  define PRCM_INFRCLKDIVS_RATIO_DIV8    (2 << PRCM_INFRCLKDIVS_RATIO_SHIFT) /*  Divide by 8 */
#  define PRCM_INFRCLKDIVS_RATIO_DIV32   (3 << PRCM_INFRCLKDIVS_RATIO_SHIFT) /*  Divide by 32 */

/* Infrastructure Clock Division Factor For DeepSleep Mode */

#define PRCM_INFRCLKDIVDS_RATIO_SHIFT    (0)       /* Bits 0-1:  Divider for MCU_AON clocks sleep mode */
#define PRCM_INFRCLKDIVDS_RATIO_MASK     (3 << PRCM_INFRCLKDIVDS_RATIO_SHIFT)
#  define PRCM_INFRCLKDIVDS_RATIO_DIV1   (0 << PRCM_INFRCLKDIVDS_RATIO_SHIFT) /*  Divide by 1 */
#  define PRCM_INFRCLKDIVDS_RATIO_DIV2   (1 << PRCM_INFRCLKDIVDS_RATIO_SHIFT) /*  Divide by 2 */
#  define PRCM_INFRCLKDIVDS_RATIO_DIV8   (2 << PRCM_INFRCLKDIVDS_RATIO_SHIFT) /*  Divide by 8 */
#  define PRCM_INFRCLKDIVDS_RATIO_DIV32  (3 << PRCM_INFRCLKDIVDS_RATIO_SHIFT) /*  Divide by 32 */

/* MCU Voltage Domain Control */

#define PRCM_VDCTL_ULDO                  (1 << 0)  /* Bit 0:  Request WUC to switch to uLDO */

/* Load PRCM Settings To CLKCTRL Power Domain */

#define PRCM_CLKLOADCTL_LOAD             (1 << 0)  /* Bit 0:  Load settings to CLKCTRL */
#define PRCM_CLKLOADCTL_LOADDONE         (1 << 1)  /* Bit 1:  Set when LOAD is done */

/* RFC Clock Gate */

#define PRCM_RFCCLKG_CLKEN               (1 << 0)  /* Bit 0:  Enable clock */

/* VIMS Clock Gate */

#define PRCM_VIMSCLKG_CLKEN_SHIFT        (0)       /* Bits 0-1:  Clock control */
#define PRCM_VIMSCLKG_CLKEN_MASK         (3 << PRCM_VIMSCLKG_CLKEN_SHIFT)
#  define PRCM_VIMSCLKG_CLKEN_DIS        (0 << PRCM_VIMSCLKG_CLKEN_SHIFT) /* Disable clock */
#  define PRCM_VIMSCLKG_CLKEN_DISSYSCLK  (1 << PRCM_VIMSCLKG_CLKEN_SHIFT) /* Disable clock when SYCLK disabled */
#  define PRCM_VIMSCLKG_CLKEN_ENA        (3 << PRCM_VIMSCLKG_CLKEN_SHIFT) /* Enable clock */

/* SEC (PKA And TRNG And CRYPTO) And UDMA Clock Gate For Run And All Modes */

#define PRCM_SECDMACLKGR_CRYPTO_CLKEN    (1 << 0)  /* Bit 0:  Enable cypto clock */
#define PRCM_SECDMACLKGR_TRNG_CLKEN      (1 << 1)  /* Bit 1:  Enable TRNG clock */
#define PRCM_SECDMACLKGR_DMA_CLKEN       (1 << 8)  /* Bit 8:  Enable DMA clock */

/* SEC (PKA And TRNG And CRYPTO) And UDMA Clock Gate For Sleep Mode */

#define PRCM_SECDMACLKGS_CRYPTO_CLKEN    (1 << 0)  /* Bit 0:  Enable cypto clock */
#define PRCM_SECDMACLKGS_TRNG_CLKEN      (1 << 1)  /* Bit 1:  Enable TRNG clock */
#define PRCM_SECDMACLKGS_DMA_CLKEN       (1 << 8)  /* Bit 8:  Enable DMA clock */

/* SEC (PKA And TRNG and CRYPTO) And UDMA Clock Gate For Deep Sleep Mode */

#define PRCM_SECDMACLKGDS_CRYPTO_CLKEN   (1 << 0)  /* Bit 0:  Enable cypto clock */
#define PRCM_SECDMACLKGDS_TRNG_CLKEN     (1 << 1)  /* Bit 1:  Enable TRNG clock */
#define PRCM_SECDMACLKGDS_DMA_CLKEN      (1 << 8)  /* Bit 8:  Enable DMA clock */

/* GPIO Clock Gate For Run And All Modes */

#define PRCM_GPIOCLKGR_CLKEN             (1 << 0)  /* Bit 0: Enable clock */

/* GPIO Clock Gate For Sleep Mode */

#define PRCM_GPIOCLKGS_CLKEN             (1 << 0)  /* Bit 0: Enable clock */

/* GPIO Clock Gate For Deep Sleep Mode */

#define PRCM_GPIOCLKGDS_CLKEN            (1 << 0)  /* Bit 0: Enable clock */

/* GPT Clock Gate For Run And All Modes */

#define PRCM_GPTCLKGR_CLKEN_GPT0         (1 << 0)  /* Bit 0:  Enable clock for GPT0 */
#define PRCM_GPTCLKGR_CLKEN_GPT1         (1 << 1)  /* Bit 1:  Enable clock for GPT1 */
#define PRCM_GPTCLKGR_CLKEN_GPT2         (1 << 2)  /* Bit 2:  Enable clock for GPT2 */
#define PRCM_GPTCLKGR_CLKEN_GPT3         (1 << 3)  /* Bit 3:  Enable clock for GPT3 */

/* GPT Clock Gate For Sleep Mode */

#define PRCM_GPTCLKGS_CLKEN_GPT0         (1 << 0)  /* Bit 0:  Enable clock for GPT0 */
#define PRCM_GPTCLKGS_CLKEN_GPT1         (1 << 1)  /* Bit 1:  Enable clock for GPT1 */
#define PRCM_GPTCLKGS_CLKEN_GPT2         (1 << 2)  /* Bit 2:  Enable clock for GPT2 */
#define PRCM_GPTCLKGS_CLKEN_GPT3         (1 << 3)  /* Bit 3:  Enable clock for GPT3 */

/* GPT Clock Gate For Deep Sleep Mode */

#define PRCM_GPTCLKGDS_CLKEN_GPT0        (1 << 0)  /* Bit 0:  Enable clock for GPT0 */
#define PRCM_GPTCLKGDS_CLKEN_GPT1        (1 << 1)  /* Bit 1:  Enable clock for GPT1 */
#define PRCM_GPTCLKGDS_CLKEN_GPT2        (1 << 2)  /* Bit 2:  Enable clock for GPT2 */
#define PRCM_GPTCLKGDS_CLKEN_GPT3        (1 << 3)  /* Bit 3:  Enable clock for GPT3 */

/* I2C Clock Gate For Run And All Modes */

#define PRCM_I2CCLKGR_CLKEN              (1 << 0)  /* Bit 0:  Enable clock */

/* I2C Clock Gate For Sleep Mode */

#define PRCM_I2CCLKGS_CLKEN              (1 << 0)  /* Bit 0:  Enable clock */

/* I2C Clock Gate For Deep Sleep Mode */

#define PRCM_I2CCLKGDS_CLKEN             (1 << 0)  /* Bit 0:  Enable clock */

/* UART Clock Gate For Run And All Modes */

#define PRCM_UARTCLKGR_CLKEN_UART0       (1 << 0)  /* Bit 0:  UART0 Enable clock */

/* UART Clock Gate For Sleep Mode */

#define PRCM_UARTCLKGS_CLKEN_UART0       (1 << 0)  /* Bit 0:  UART0 Enable clock */

/* UART Clock Gate For Deep Sleep Mode */

