apache/nuttx/arch/arm/src/tiva/hardware/cc13x0/cc13x0_prcm.h
#define PRCM_UARTCLKGDS_CLKEN_UART0      (1 << 0)  /* Bit 0:  UART0 Enable clock */

/* SSI Clock Gate For Run And All Modes */

#define PRCM_SSICLKGR_CLKEN_SSI0       (1 << 0)  /* Bit 0:  SSI0 Enable clock */
#define PRCM_SSICLKGR_CLKEN_SSI1       (1 << 1)  /* Bit 1:  SSI1 Enable clock */

/* SSI Clock Gate For Sleep Mode */

#define PRCM_SSICLKGS_CLKEN_SSI0       (1 << 0)  /* Bit 0:  SSI0 Enable clock */
#define PRCM_SSICLKGS_CLKEN_SSI1       (1 << 1)  /* Bit 1:  SSI1 Enable clock */

/* SSI Clock Gate For Deep Sleep Mode */

#define PRCM_SSICLKGDS_CLKEN_SSI0      (1 << 0)  /* Bit 0:  SSI0 Enable clock */
#define PRCM_SSICLKGDS_CLKEN_SSI1      (1 << 1)  /* Bit 1:  SSI1 Enable clock */

/* I2S Clock Gate For Run And All Modes */

#define PRCM_I2SCLKGR_CLKEN            (1 << 0)  /* Bit 0:  SSI0 Enable clock */

/* I2S Clock Gate For Sleep Mode */

#define PRCM_I2SCLKGS_CLKEN            (1 << 0)  /* Bit 0:  SSI0 Enable clock */

/* I2S Clock Gate For Deep Sleep Mode */

#define PRCM_I2SCLKGDS_CLKEN            (1 << 0)  /* Bit 0:  SSI0 Enable clock */

/* Internal */

#define PRCM_CPUCLKDIV_DIV              (1 << 0)  /* Bit 0:  Ratio */
#  define PRCM_CPUCLKDIV_DIV1           (0)
#  define PRCM_CPUCLKDIV_DIV2           PRCM_CPUCLKDIV_DIV

/* I2S Clock Control */

#define PRCM_I2SBCLKSEL_SRC             (1 << 0)  /* Bit 0:  BCLK source selector */
#  define PRCM_I2SBCLKSEL_EXTERNAL      (0)
#  define PRCM_I2SBCLKSEL_INTERNAL      PRCM_I2SBCLKSEL_SRC

/* GPT Scalar */

#define PRCM_GPTCLKDIV_SHIFT         (0)       /* Bit 0-3: Ratio */
#define PRCM_GPTCLKDIV_MASK          (15 << PRCM_GPTCLKDIV_SHIFT)
#  define PRCM_GPTCLKDIV_DIV1        (0 << PRCM_GPTCLKDIV_SHIFT)
#  define PRCM_GPTCLKDIV_DIV2        (1 << PRCM_GPTCLKDIV_SHIFT)
#  define PRCM_GPTCLKDIV_DIV4        (2 << PRCM_GPTCLKDIV_SHIFT)
#  define PRCM_GPTCLKDIV_DIV8        (3 << PRCM_GPTCLKDIV_SHIFT)
#  define PRCM_GPTCLKDIV_DIV16       (4 << PRCM_GPTCLKDIV_SHIFT)
#  define PRCM_GPTCLKDIV_DIV32       (5 << PRCM_GPTCLKDIV_SHIFT)
#  define PRCM_GPTCLKDIV_DIV65       (6 << PRCM_GPTCLKDIV_SHIFT)
#  define PRCM_GPTCLKDIV_DIV128      (7 << PRCM_GPTCLKDIV_SHIFT)
#  define PRCM_GPTCLKDIV_DIV256      (8 << PRCM_GPTCLKDIV_SHIFT)

/* I2S Clock Control */

#define PRCM_I2SCLKCTL_EN                 (1 << 0)  /* Emable MCLK, BCLK, and WCLK */
#define PRCM_I2SCLKCTL_WCLKPHASE_SHIFT    1         /* Bits 1-2: Wclock division ration mode */
#define PRCM_I2SCLKCTL_WCLKPHASE_MASK     (3 << PRCM_I2SCLKCTL_WCLKPHASE_SHIFT)
#  define PRCM_I2SCLKCTL_WCLKPHASE_SINGLE (0 << PRCM_I2SCLKCTL_WCLKPHASE_SHIFT) /* Single phase */
#  define PRCM_I2SCLKCTL_WCLKPHASE_DUAL   (1 << PRCM_I2SCLKCTL_WCLKPHASE_SHIFT) /* Dual phase */
#  define PRCM_I2SCLKCTL_WCLKPHASE_USER   (2 << PRCM_I2SCLKCTL_WCLKPHASE_SHIFT) /* User Defined */
#define PRCM_I2SCLKCTL_POSEDGE            (1 << 3)  /* Bit 3: Sample/clock on positive edge */
#  define PRCM_I2SCLKCTL_NEGEDGE          (0)       /*        Sample/clock on negative edge */

/* MCLK Division Ratio */

#define PRCM_I2SMCLKDIV_MDIV_SHIFT   (0)      /* Bits 0-9: MCLK divider */
#define PRCM_I2SMCLKDIV_MDIV_MASK    (0x3ff << PRCM_I2SMCLKDIV_MDIV_SHIFT)
#  define PRCM_I2SMCLKDIV_MDIV(n)    (((uint32_t)(n) & 0x3ff) << PRCM_I2SMCLKDIV_MDIV_SHIFT)

/* BCLK Division Ratio */

#define PRCM_I2SBCLKDIV_BDIV_SHIFT   (0)      /* Bits 0-9: MCLK divider */
#define PRCM_I2SBCLKDIV_BDIV_MASK    (0x3ff << PRCM_I2SBCLKDIV_BDIV_SHIFT)
#  define PRCM_I2SBCLKDIV_BDIV(n)    (((uint32_t)(n) & 0x3ff) << PRCM_I2SBCLKDIV_BDIV_SHIFT)

/* WCLK Division Ratio */

#define PRCM_I2SWCLKDIV_WDIV_SHIFT   (0)      /* Bits 0-9: MCLK divider */
#define PRCM_I2SWCLKDIV_WDIV_MASK    (0x3ff << PRCM_I2SWCLKDIV_WDIV_SHIFT)
#  define PRCM_I2SWCLKDIV_WDIV(n)    ((uint32_t)(n) << PRCM_I2SWCLKDIV_WDIV_SHIFT)
#  define PRCM_I2SWCLKDIV_WDIV(n)    (((uint32_t)(n) & 0x3ff) << PRCM_I2SWCLKDIV_WDIV_SHIFT)

/* SW Initiated Resets */

#define PRCM_SWRESET_MCU             (1 << 0)  /* Bit 0:  Reset MCU */

/*  WARM Reset Control And Status */

#define PRCM_WARMRESET_WDT_STAT      (1 << 0)  /* Bit 0:  WDT event occurred */
#define PRCM_WARMRESET_LOCKUP_STAT   (1 << 1)  /* Bit 1:  System CPU LOCKUP event occurred */
#define PRCM_WARMRESET_WRTO_PINRESET (1 << 2)  /* Bit 2:  Warm reset emulates pin reset */

/* Power Domain Control */

#define PRCM_PDCTL0_RFC_ON           (1 << 0)  /* Bit 0:  RFC domain powered on */
#define PRCM_PDCTL0_SERIAL_ON        (1 << 1)  /* Bit 1:  SERIAL domain powered up */
#define PRCM_PDCTL0_PERIPH_ON        (1 << 2)  /* Bit 2:  PERIPH domain powered up */

/* RFC Power Domain Control */

#define PRCM_PDCTL0RFC_ON            (1 << 0)  /* Bit 0:  Alias for PDCTL0.RFC_ON */

/* SERIAL Power Domain Control */

#define PRCM_PDCTL0SERIAL_ON         (1 << 0)  /* Bit 0:  Alias for PDCTL0.SERIAL_ON */

/* PERIPH Power Domain Control */

#define PRCM_PDCTL0PERIPH_ON         (1 << 0)  /* Bit 0:  Alias for PDCTL0.PERIOPH_ON */

/* Power Domain Status */

#define PRCM_PDSTAT0_RFC_ON           (1 << 0)  /* Bit 0:  RFC domain powered on */
#define PRCM_PDSTAT0_SERIAL_ON        (1 << 1)  /* Bit 1:  SERIAL domain powered up */
#define PRCM_PDSTAT0_PERIPH_ON        (1 << 2)  /* Bit 2:  PERIPH domain powered up */

/* RFC Power Domain Status */

#define PRCM_PDSTAT0RFC_ON            (1 << 0)  /* Bit 0:  Alias for PDSTAT0.RFC_ON */

/* SERIAL Power Domain Status */

#define PRCM_PDSTAT0SERIAL_ON         (1 << 0)  /* Bit 0:  Alias for PDSTAT0.SERIAL_ON */

/* PERIPH Power Domain Status */

#define PRCM_PDSTAT0PERIPH_ON         (1 << 0)  /* Bit 0:  Alias for PDSTAT0.PERIPH_ON */

/* Power Domain Control */

#define PRCM_PDCTL1_CPU_ON            (1 << 1)  /* Bit 1:  Initiate power-on CPU domain */
#define PRCM_PDCTL1_RFC_ON            (1 << 2)  /* Bit 2:  RFC power off if PDCTL.RFC_ON */
#define PRCM_PDCTL1_VIMS_MODE_SHIFT   (3)       /* Bits 3-4: VIMS mode */
#define PRCM_PDCTL1_VIMS_MODE_MASK    (3 << PRCM_PDCTL1_VIMS_MODE_SHIFT)
#  define PRCM_PDCTL1_VIMS_MODE_CPU   (0 << PRCM_PDCTL1_VIMS_MODE_SHIFT) /* When CPU domain powered */
#  define PRCM_PDCTL1_VIMS_MODE_BUS   (1 << PRCM_PDCTL1_VIMS_MODE_SHIFT) /* When BUS domain powered */
#  define PRCM_PDCTL1_VIMS_MODE_BLOCK (2 << PRCM_PDCTL1_VIMS_MODE_SHIFT) /* Block on next wakeup */

