apache/nuttx/arch/arm/src/tiva/hardware/cc13x0/cc13x0_prcm.h
/* CPU Power Domain Direct Control */

#define PRCM_PDCTL1CPU_ON             (1 << 0)  /* Bit 0:  Alias for PDCTL1.CPU_ON */

/* RFC Power Domain Direct Control */

#define PRCM_PDCTL1RFC_ON             (1 << 0)  /* Bit 0:  Alias for PDCTL1.RFC_ON */

/* VIMS Mode Direct Control */

#define PRCM_PDCTL1VIMS_ON            (1 << 0)  /* Bit 0:  Alias for PDCTL1.VIMS_ON */

/* Power Manager Status */

#define PRCM_PDSTAT1_CPU_ON           (1 << 1)  /* Bit 1:  CPU domain is accessible */
#define PRCM_PDSTAT1_RFC_ON           (1 << 2)  /* Bit 2:  RFC domain is accessible */
#define PRCM_PDSTAT1_VIMS_ON          (1 << 3)  /* Bit 3:  VIMS domain is accessible */
#define PRCM_PDSTAT1_BUS_ON           (1 << 4)  /* Bit 4:  BUS domain is accessible */

/* BUS Power Domain Direct Read Status */

#define PRCM_PDSTAT1BUS_ON            (1 << 0)  /* Bit 0:  Alias for PSTAT1.BUS_ON */

/* RFC Power Domain Direct Read Status */

#define PRCM_PDSTAT1RFC_ON            (1 << 0)  /* Bit 0:  Alias for PSTAT1.RFC_ON */

/* CPU Power Domain Direct Read Status */

#define PRCM_PDSTAT1CPU_ON            (1 << 0)  /* Bit 0:  Alias for PSTAT1.CPU_ON */

/* VIMS Mode Direct Read Status */

#define PRCM_PDSTAT1VIMS_ON           (1 << 0)  /* Bit 0:  Alias for PSTAT1.VIMS_ON */

/* Control To RFC (32-bits RFCBITS) */

/* Selected RFC Mode */

#define PRCM_RFCMODESEL_CURR_SHIFT    (0)       /* Bits 0-2:  Selects RFC command set */
#define PRCM_RFCMODESEL_CURR_MASK     (7 << PRCM_RFCMODESEL_CURR_SHIFT)
#  define PRCM_RFCMODESEL_CURR_MODE0  (0 << PRCM_RFCMODESEL_CURR_SHIFT)
#  define PRCM_RFCMODESEL_CURR_MODE1  (1 << PRCM_RFCMODESEL_CURR_SHIFT)
#  define PRCM_RFCMODESEL_CURR_MODE2  (2 << PRCM_RFCMODESEL_CURR_SHIFT)
#  define PRCM_RFCMODESEL_CURR_MODE3  (3 << PRCM_RFCMODESEL_CURR_SHIFT)
#  define PRCM_RFCMODESEL_CURR_MODE4  (4 << PRCM_RFCMODESEL_CURR_SHIFT)
#  define PRCM_RFCMODESEL_CURR_MODE5  (5 << PRCM_RFCMODESEL_CURR_SHIFT)
#  define PRCM_RFCMODESEL_CURR_MODE6  (6 << PRCM_RFCMODESEL_CURR_SHIFT)
#  define PRCM_RFCMODESEL_CURR_MODE7  (7 << PRCM_RFCMODESEL_CURR_SHIFT)

/* Allowed RFC Modes */

#define PRCM_RFCMODEHWOPT_CURR_SHIFT    (0)     /* Bits 0-2:  Permitted RFC modes */
#define PRCM_RFCMODEHWOPT_CURR_MASK     (7 << PRCM_RFCMODEHWOPT_CURR_SHIFT)
#  define PRCM_RFCMODEHWOPT_CURR_MODE0  (0 << PRCM_RFCMODEHWOPT_CURR_SHIFT)
#  define PRCM_RFCMODEHWOPT_CURR_MODE1  (1 << PRCM_RFCMODEHWOPT_CURR_SHIFT)
#  define PRCM_RFCMODEHWOPT_CURR_MODE2  (2 << PRCM_RFCMODEHWOPT_CURR_SHIFT)
#  define PRCM_RFCMODEHWOPT_CURR_MODE3  (3 << PRCM_RFCMODEHWOPT_CURR_SHIFT)
#  define PRCM_RFCMODEHWOPT_CURR_MODE4  (4 << PRCM_RFCMODEHWOPT_CURR_SHIFT)
#  define PRCM_RFCMODEHWOPT_CURR_MODE5  (5 << PRCM_RFCMODEHWOPT_CURR_SHIFT)
#  define PRCM_RFCMODEHWOPT_CURR_MODE6  (6 << PRCM_RFCMODEHWOPT_CURR_SHIFT)
#  define PRCM_RFCMODEHWOPT_CURR_MODE7  (7 << PRCM_RFCMODEHWOPT_CURR_SHIFT)

/* Power Profiler Register */

#define PRCM_PWRPROFSTAT_VALUE_SHIFT    (0)     /* Bits 0-7: Timestamp value */
#define PRCM_PWRPROFSTAT_VALUE_MASK     (0xff << PRCM_PWRPROFSTAT_VALUE_SHIFT)

/* Memory Retention Control */

#define PRCM_RAMRETEN_VIMS_SHIFT        (0)       /* Bits 0-1: VIMS memory retention enabled */
#define PRCM_RAMRETEN_VIMS_MASK         (3 << PRCM_RAMRETEN_VIMS_SHIFT)
#  define PRCM_RAMRETEN_VIMS_TRAM       (1 << PRCM_RAMRETEN_VIMS_SHIFT)
#  define PRCM_RAMRETEN_VIMS_CRAM       (2 << PRCM_RAMRETEN_VIMS_SHIFT)
#define PRCM_RAMRETEN_RFC               (1 << 2)  /* Bit 2:  RFC SRAM retention enabled */

/****************************************************************************************************
 * Public Types
 ****************************************************************************************************/

/****************************************************************************************************
 * Public Data
 ****************************************************************************************************/

/****************************************************************************************************
 * Public Function Prototypes
 ****************************************************************************************************/

#endif /* __ARCH_ARM_SRC_TIVA_HARDWARE_CC13X0_CC13X0_PRCM_H */
